# アプリの保存場所を指定
cask_args appdir: "/Applications"

## 必須ツール
### 現在のシェル: echo $SHELL
### シェル一覧: cat /etc/shells
### 切り替え: chsh -s /bin/zsh
brew 'zsh'

### To install useful key bindings and fuzzy completion:
### 1. $(brew --prefix)/opt/fzf/install
### 2. terminalフォルダの中身を反映させる
brew 'fzf'

brew 'git'
brew 'mysql'

cask "docker"
cask "iterm2"


## 便利ツール
cask "google-chrome"
cask "slack"
cask "discord"
cask "amazon-music"
cask "clipy"
cask "toggl-track"
brew 'tree'

### cat
brew 'bat'

### ls
brew 'exa'

### jq
brew 'jq'
