# アプリの保存場所を指定
cask_args appdir: "/Applications"

## 必須ツール
### 現在のシェル: echo $SHELL
### シェル一覧: cat /etc/shells
### 切り替え: chsh -s /bin/zsh
brew 'zsh'

### To install useful key bindings and fuzzy completion:
### 1. $(brew --prefix)/opt/fzf/install
### 2. terminalフォルダの中身を反映させる
brew 'fzf'

brew 'git'
brew 'mysql'

cask "docker"
cask "iterm2"

## 言語

### Golang
brew "go"

### Python
### pyenv install --list
### pyenv install 3.9.5
###
brew "pyenv"

### node
### echo "eval \"$(nodenv init -)\"" >> ~/.zshrc
brew "nodenv"

### terraform
brew "tfenv"

### aws
brew "awscli"


## 便利ツール
cask "intellij-idea"
cask "google-chrome"
cask "slack"
cask "discord"
cask "amazon-music"
cask "clipy"
cask "toggl-track"

brew 'tree'

### cat
brew 'bat'

### ls
brew 'exa'

### jq
brew 'jq'

### 負荷試験
# brew 'vegeta'
# brew 'jplot'
# brew 'jaggr'

### Flutter
### flutter create -i swift -a kotlin yourappname
brew "flutter"
brew "cocoapods"

cask "homebrew/cask-versions/temurin8"
brew "android-sdk"
cask "android-studio"